# CannotPlaceSystemMullionFamilyOnCurtainWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CannotPlaceSystemMullionFamilyOnCurtainWall Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Can't place System Mullion Family on this Curtain Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceSystemMullionFamilyOnCurtainWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceSystemMullionFamilyOnCurtainWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceSystemMullionFamilyOnCurtainWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace